(select)=
# SELECT

In [1]:
%LOAD ../data/employees.db

Met `SELECT` kun je data selecteren van een database. Met `FROM` geef je aan uit welke tabel de informatie gehaald moet worden. En met `WHERE` kun je voorwaarden stellen aan de selectie.

Om alle rijen en kolommen van een tabel op te halen, gebruik je de volgende query.

```sql
SELECT * 
FROM tabelnaam;
```

In [2]:
SELECT *
FROM regions;

+-----------+------------------------+
| region_id | region_name            |
+-----------+------------------------+
| 1.0       | Europe                 |
+-----------+------------------------+
| 2.0       | Americas               |
+-----------+------------------------+
| 3.0       | Asia                   |
+-----------+------------------------+
| 4.0       | Middle East and Africa |
+-----------+------------------------+

Je kunt ook een beperkt aantal kolommen ophalen. Dat doe je als volgt.

```sql
SELECT kolom1, kolom2, ...
FROM tabelnaam;
```

Bijvoorbeeld:

In [4]:
SELECT first_name, last_name, job_id
FROM employees;

+------------+-----------+------------+
| first_name | last_name | job_id     |
+------------+-----------+------------+
| Steven     | King      | AD_PRES    |
+------------+-----------+------------+
| Neena      | Kochhar   | AD_VP      |
+------------+-----------+------------+
| Lex        | De Haan   | AD_VP      |
+------------+-----------+------------+
| Alexander  | Hunold    | IT_PROG    |
+------------+-----------+------------+
| Bruce      | Ernst     | IT_PROG    |
+------------+-----------+------------+
| Diana      | Lorentz   | IT_PROG    |
+------------+-----------+------------+
| Kevin      | Mourgos   | ST_MAN     |
+------------+-----------+------------+
| Trenna     | Rajs      | ST_CLERK   |
+------------+-----------+------------+
| Curtis     | Davies    | ST_CLERK   |
+------------+-----------+------------+
| Randall    | Matos     | ST_CLERK   |
+------------+-----------+------------+
| Peter      | Vargas    | ST_CLERK   |
+------------+-----------+------------+
| Eleni      | Zlotkey   | SA_MAN     |
+------------+-----------+------------+
| Ellen      | Abel      | SA_REP     |
+------------+-----------+------------+
| Jonathon   | Taylor    | SA_REP     |
+------------+-----------+------------+
| Kimberely  | Grant     | SA_REP     |
+------------+-----------+------------+
| Jennifer   | Whalen    | AD_ASST    |
+------------+-----------+------------+
| Michael    | Hartstein | MK_MAN     |
+------------+-----------+------------+
| Pat        | Fay       | MK_REP     |
+------------+-----------+------------+
| Shelley    | Higgins   | AC_MGR     |
+------------+-----------+------------+
| William    | Gietz     | AC_ACCOUNT |
+------------+-----------+------------+

De voorwaarde waaraan voldaan moet worden, stel je met `WHERE`.

```sql
SELECT kolom1, kolom2, ...
FROM tabelnaam
WHERE ...;
```

In [5]:
SELECT first_name, last_name, job_id
FROM employees
WHERE job_id = 'SA_REP';

+------------+-----------+--------+
| first_name | last_name | job_id |
+------------+-----------+--------+
| Ellen      | Abel      | SA_REP |
+------------+-----------+--------+
| Jonathon   | Taylor    | SA_REP |
+------------+-----------+--------+
| Kimberely  | Grant     | SA_REP |
+------------+-----------+--------+